{"config": {"layers": [{"config": {"name": "embedding_1", "embeddings_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, 1000], "input_dim": 150957, "trainable": true, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 1000, "dtype": "float32", "mask_zero": false, "output_dim": 50}, "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "name": "conv1d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "padding": "valid", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "strides": [1], "activation": "relu", "dilation_rate": [1], "kernel_size": [5], "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1", "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"bias_regularizer": null, "name": "dense_1", "units": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_2", "units": 20, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.3"}