{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "embedding_1", "batch_input_shape": [null, 1000], "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "input_dim": 156137, "output_dim": 50, "embeddings_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 1000, "embeddings_constraint": null, "dtype": "float32"}, "class_name": "Embedding"}, {"config": {"kernel_size": [5], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1], "kernel_regularizer": null, "name": "conv1d_1", "filters": 128, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "dilation_rate": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "units": 20, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}